app/controllers/videos_controller.rb

SELECT  "videos".* FROM "videos" WHERE (id < 2)  ORDER BY "videos"."id" DESC LIMIT 1
---
  def show
    @videos = Video.all

INSERT INTO "videos" ("wistia", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wistia", "abc"], ["description", "Long beach"], ["created_at", "2017-05-27 14:51:41.016996"], ["updated_at", "2017-05-27 14:51:41.016996"]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

UPDATE "videos" SET "wistia" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["wistia", "s6sifeo2o6"], ["updated_at", "2017-05-27 16:02:54.313883"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @video.update(video_params)